tap "koekeishiya/formulae"
brew "autojump"
brew "difftastic"
brew "fastfetch"
brew "gh"
brew "git"
brew "python@3.14"
brew "httpie"
brew "node"
brew "ripgrep"
brew "ruff"
brew "starship"
brew "tig"
brew "tldr"
brew "tree"
brew "typos-cli"
brew "uv"
brew "koekeishiya/formulae/yabai"
cask "pearcleaner"
vscode "aaron-bond.better-comments"
vscode "antfu.file-nesting"
vscode "bibhasdn.unique-lines"
vscode "buianhthang.xml2json"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "catppuccin.catppuccin-vsc-pack"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "khaeransori.json2csv"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "postman.postman-for-vscode"
vscode "tamasfe.even-better-toml"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
